# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + Triplet (channel-only, P3 position) + DyHead + WIoU — variant "TDW-CO-P3"
#
# 与 TDW-CO 唯一区别：TripletAttention 从 P5 末端移至 P3 source 末端。
# 动机：P3/8 是最高分辨率 backbone 特征（640输入→80×80），路侧远距离小目标
#       （行人/骑行者）主要由 P3 检测。Triplet channel-only 在此层直接增强小目标
#       的跨维通道交互，与 DyHead 的 spatial attention 机制正交。

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone — TripletAttention(channel-only) at P3 end
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, TripletAttention, [True]]      # 5  ★ channel-only Triplet at P3 end
  - [-1, 1, Conv, [512, 3, 2]]             # 6  P4/16
  - [-1, 2, C3k2, [512, True]]             # 7  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 8  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 9
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]                # 11 (P5 source)

# YOLO11 head (PAN-FPN; DyHeadDetect)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]]                    # 13 cat backbone P4 (layer 7)
  - [-1, 2, C3k2, [512, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]                    # 16 cat P3 (layer 5, after Triplet)
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 23 (P5/32-large)

  - [[17, 20, 23], 1, DyHeadDetect, [nc]]        # 24 DyHeadDetect(P3, P4, P5)
