# Ultralytics YOLO11 + Triplet Attention (variant +T)
# Insert TripletAttention at backbone P5 end (before SPPF). Channel count unchanged.
# Layer index shift: SPPF 9->10, C2PSA 10->11; head refs to backbone P3=4, P4=6 unchanged
# (those layers are before the inserted Triplet); refs to C2PSA shift 10->11; P5 head refs
# 13->14 (C3k2 after first upsample). Detect indices [16,19,22] -> [17,20,23].

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone with TripletAttention at P5 end
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, Conv, [512, 3, 2]]             # 5  P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, TripletAttention, []]          # 9  ★ NEW: Triplet at P5 end
  - [-1, 1, SPPF, [1024, 5]]               # 10
  - [-1, 2, C2PSA, [1024]]                 # 11 (P5 source)

# YOLO11 head (indices shifted +1 vs original)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]              # 24 Detect(P3, P4, P5)
