# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + DyHead + WIoU + CoordAttention — variant "DWCA"
#
# 三模块分解消融：DyHead + WIoU + CoordAttention，去掉 P2 小目标检测头。
#
# 目的：在 DWCA-P2 成功后移除 P2/4 高分辨率检测分支，仅保留 CoordAttention，
# 用于判断 CoordAttention 在不增加 P2 高计算量时是否有独立贡献。

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone + CoordAttention at P3 end
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, CoordAttention, []]            # 5  ★ CA at P3 end
  - [-1, 1, Conv, [512, 3, 2]]             # 6  P4/16
  - [-1, 2, C3k2, [512, True]]             # 7  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 8  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 9
  - [-1, 1, SPPF, [1024, 5]]               # 10
  - [-1, 2, C2PSA, [1024]]                 # 11 (P5 source)

# YOLO11 head — standard 3-scale PAN-FPN + DyHeadDetect(P3, P4, P5)
head:
  # --- P5 → P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 14

  # --- P4 → P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]                    # 16 cat P3 (after CA)
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  # --- P3 → P4 ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4/16-medium)

  # --- P4 → P5 ---
  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                  # 23 (P5/32-large)

  # --- Detect: 3 scales ---
  - [[17, 20, 23], 1, DyHeadDetect, [nc]]        # 24 DyHeadDetect(P3, P4, P5)
