# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + DyHead + WIoU + CoordAttention + P2 小目标头 — variant "DWCA-P2"
#
# 四模块方案（去掉 Triplet，替换为 CA）：
#   1. DyHead：多尺度 scale/spatial/task 注意力（已验证有效）
#   2. WIoU v3：focal bbox loss（已验证与 DyHead 协同有效）
#   3. CoordAttention：位置编码 + 通道注意力，与 DyHead spatial 正交
#   4. P2/4 小目标检测头：160×160 高分辨率，直击路侧远距小目标
#
# 设计理由：Triplet 在本任务已实证无正收益（TDW/TDW-CO 均未超 +DW），
# CA 的 1D H/W 位置编码与 DyHead 的 2D spatial conv 维度不同，理论冲突小。

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone + CoordAttention at P3 end
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2  (P2 source for P2 head)
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, CoordAttention, []]            # 5  ★ CA at P3 end
  - [-1, 1, Conv, [512, 3, 2]]             # 6  P4/16
  - [-1, 2, C3k2, [512, True]]             # 7  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 8  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 9
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]                # 11 (P5 source)

# YOLO11 head — PAN-FPN with P2 branch + DyHeadDetect(P2, P3, P4, P5)
head:
  # --- P5 → P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 14

  # --- P4 → P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]]                    # 16 cat P3 (after CA)
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  # --- P3 → P2 (new) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 2], 1, Concat, [1]]                    # 19 cat backbone P2 (layer 2)
  - [-1, 2, C3k2, [128, False]]                  # 20 (P2/4-tiny) ★ new

  # --- P2 → P3 (bottom-up) ---
  - [-1, 1, Conv, [128, 3, 2]]                   # 21
  - [[-1, 17], 1, Concat, [1]]                   # 22 cat head P3
  - [-1, 2, C3k2, [256, False]]                  # 23 (P3/8-small, refined)

  # --- P3 → P4 (bottom-up) ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 24
  - [[-1, 14], 1, Concat, [1]]                   # 25 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 26 (P4/16-medium)

  # --- P4 → P5 (bottom-up) ---
  - [-1, 1, Conv, [512, 3, 2]]                   # 27
  - [[-1, 11], 1, Concat, [1]]                   # 28 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 29 (P5/32-large)

  # --- Detect: 4 scales ---
  - [[20, 23, 26, 29], 1, DyHeadDetect, [nc]]    # 30 DyHeadDetect(P2, P3, P4, P5) ★ 4 inputs
