# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + Triplet Attention + DyHead — variant "+TD"
# = yolo11-t backbone (TripletAttention inserted at P5 end before SPPF)
#   + DyHeadDetect head (cascaded spatial/scale/task DyHead blocks before Detect cv2/cv3)
# Layer indices match yolo11-t.yaml (one extra layer before SPPF), only the final Detect
# is swapped for DyHeadDetect.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-td.yaml' will call yolo11-td.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone with TripletAttention at P5 end
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, Conv, [512, 3, 2]]             # 5  P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, TripletAttention, []]          # 9  ★ Triplet at P5 end
  - [-1, 1, SPPF, [1024, 5]]               # 10
  - [-1, 2, C2PSA, [1024]]                 # 11 (P5 source)

# YOLO11 head (PAN-FPN unchanged; final Detect -> DyHeadDetect)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 23 (P5/32-large)

  - [[17, 20, 23], 1, DyHeadDetect, [nc]]        # 24 DyHeadDetect(P3, P4, P5)
