# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + Triplet (channel-only, P5) + DyHead×3 + WIoU — variant "TDW-CO-D3"
#
# 与 TDW-CO 唯一区别：DyHeadDetect → DyHeadDetect3（num_blocks 2→3）。
# 动机：DyHead 是当前唯一被验证有效的模块（+D 单独贡献 mAP50 +0.7），
#       加深级联 block 数在理论上有继续提升空间。
#       路侧检测对 FPS 不敏感（设备算力充裕），3 块在工程上可接受。

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone — same as TDW-CO (TripletAttention channel-only at P5 end)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, Conv, [512, 3, 2]]             # 5  P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, TripletAttention, [True]]      # 9  Triplet at P5 end (channel-only)
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]                # 11 (P5 source)

# YOLO11 head — DyHeadDetect3 (3 cascaded blocks)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 23 (P5/32-large)

  - [[17, 20, 23], 1, DyHeadDetect3, [nc]]       # 24 ★ DyHeadDetect3(P3, P4, P5) — 3 blocks
