# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + DyHead + WIoU + P2 小目标头 — variant "DW-P2"
#
# 三模块分解消融：DyHead + WIoU + P2 小目标检测头。
#
# 目的：在 DWCA-P2 成功后去掉 CoordAttention，仅保留 P2/4 高分辨率检测分支，
# 用于判断 DWCA-P2 的主要收益是否来自 P2 小目标头。

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone（无 Triplet，无 CoordAttention）
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2  (P2 source for P2 head)
  - [-1, 1, Conv, [256, 3, 2]]             # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  (P3 source)
  - [-1, 1, Conv, [512, 3, 2]]             # 5  P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  (P4 source)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (P5 source)

# YOLO11 head — PAN-FPN with P2 branch + DyHeadDetect(P2, P3, P4, P5)
head:
  # --- P5 → P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 13

  # --- P4 → P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 16 (P3/8-small)

  # --- P3 → P2 (new) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 2], 1, Concat, [1]]                    # 18 cat backbone P2 (layer 2)
  - [-1, 2, C3k2, [128, False]]                  # 19 (P2/4-tiny) ★ new

  # --- P2 → P3 (bottom-up) ---
  - [-1, 1, Conv, [128, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21 cat head P3
  - [-1, 2, C3k2, [256, False]]                  # 22 (P3/8-small, refined)

  # --- P3 → P4 (bottom-up) ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 25 (P4/16-medium)

  # --- P4 → P5 (bottom-up) ---
  - [-1, 1, Conv, [512, 3, 2]]                   # 26
  - [[-1, 10], 1, Concat, [1]]                   # 27 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                  # 28 (P5/32-large)

  # --- Detect: 4 scales ---
  - [[19, 22, 25, 28], 1, DyHeadDetect, [nc]]    # 29 DyHeadDetect(P2, P3, P4, P5) ★ 4 inputs
